import {Title} from "../Title.jsx";
import Accordion from "./Accordion.jsx";
import Icons from "../../constants";

const Faq = () =>  {

  return (
    <section className="faq">
      <div className="container-fluid">
        <div className="faq-inner">
          <div className="faq-content">
            <Title title='հաճախ տրվող հարցեր' />

            <div className="accordion-wrapper">
              <Accordion
                title="Սպառողին հասցնել առողջ և անվտանգ սնունդ"
                text="«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։"
              />
              <Accordion
                title="Սպառողին հասցնել առողջ և անվտանգ սնունդ"
                text="«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։"
              />
              <Accordion
                title="Սպառողին հասցնել առողջ և անվտանգ սնունդ"
                text="«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։"
              />
              <Accordion
                title="Սպառողին հասցնել առողջ և անվտանգ սնունդ"
                text="«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։"
              />
              <Accordion
                title="Սպառողին հասցնել առողջ և անվտանգ սնունդ"
                text="«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։"
              />
              <Accordion
                title="Սպառողին հասցնել առողջ և անվտանգ սնունդ"
                text="«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։"
              />
            </div>
          </div>
          <div>
            <img src={Icons.FAQ_IMG} alt="faq" />
          </div>
        </div>
      </div>
    </section>
  )
};

export default Faq;