import {Title} from "../Title.jsx";
import Accordion from "./Accordion.jsx";
import Icons from "../../constants";
import {useState} from "react";

const Faq = () =>  {
  const [openAccordionId, setOpenAccordionId] = useState(null);

  const handleAccordionClick = (id) => {
    setOpenAccordionId((prevId) => (prevId === id ? null : id));
  };

  const accordionData = [
    {
      id: 1,
      title: 'Սպառողին հասցնել առողջ և անվտանգ սնունդ',
      text: '«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։'
    },
    {
      id: 2,
      title: 'Սպառողին հասցնել առողջ և անվտանգ սնունդ',
      text: '«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։'
    },
    {
      id: 3,
      title: 'Լինել պատասխանատու հասարակության բոլոր շերտերի առաջ` գիտակցելով արտադրանքի կարևորությունը',
      text: '«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։'
    },
    {
      id: 4,
      title: 'Սպառողին հասցնել առողջ և անվտանգ սնունդ',
      text: '«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։'
    },
    {
      id: 5,
      title: 'Սպառողին հասցնել առողջ և անվտանգ սնունդ',
      text: '«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։'
    },
    {
      id: 6,
      title: 'Սպառողին հասցնել առողջ և անվտանգ սնունդ',
      text: '«ԲԵԿՈՆ ՊՐՈԴՈւԿՏ» ընկերությունը հիմնադրվել է 1995թ. և զբաղվում է մսամթերքի եւ կիսաֆաբրիկատների արտադրությամբ: Գործունեությունը սկսելով փոքր արտադրամասում` ընկերությունը ժամանակի ընթացքում ընդարձակվել է եւ այսօր գործում է ժամանակակից։'
    },
  ];


  return (
    <section className="faq">
      <div className="container-fluid">
        <div className="faq-inner">
          <div className="faq-content">
            <Title title='հաճախ տրվող հարցեր' />

            <div className="accordion-wrapper">
              {accordionData.map((accordion) => (
                  <Accordion
                      key={accordion.id}
                      id={accordion.id}
                      title={accordion.title}
                      text={accordion.text}
                      isOpen={openAccordionId === accordion.id}
                      handleAccordionClick={handleAccordionClick}
                  />
              ))}
            </div>
          </div>
          <div className="faq-right-col">
            <img src={Icons.FAQ_IMG} alt="faq" />
          </div>
        </div>
      </div>
    </section>
  )
};

export default Faq;